Catalogs/Заметки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Заметки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеЛицевогоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаНачислений</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПениПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.РазовоеНачислениеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаменаПриборовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеУслугамиПодробно</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаЗапасы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеЗапасовУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПроведениеРемонта</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеСубсидиями</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеПриборамиУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеТарифами</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоказанийПриборовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.Голосование</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнформационныйЛистДляГолосования</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланированиеАвансов</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеЛьготами</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.Претензия</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеОбщедомовыхПриборовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПоказанийПриборовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеСоставомЖильцов</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеДополнительныхНачислений</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСодержания</Name>
					<Comment>Реквизит для полнотекстового поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляРабочегоСтола</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пометка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаЗаметок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НапоминанияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиВремениНапоминания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиВремениНапоминания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалВремениНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Comment>Представление источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаЗапасы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеЛицевогоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаНачислений</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПениПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.РазовоеНачислениеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаменаПриборовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.БухгалтерскаяСправкаПоЗатратам</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬКорректировкаОплат</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеУслугамиПодробно</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаЗапасы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеЗапасовУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПроведениеРемонта</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеСубсидиями</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеЛицевогоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеПриборамиУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеТарифами</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВыдачеСудебногоПриказа</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоказанийПриборовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛьготыСубсидииДляБухгалтерии</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПодомовойУчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Голосование</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнформационныйЛистДляГолосования</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДляБухгалтерии</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланированиеАвансов</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеЛьготами</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.Претензия</v8:Type>
						<v8:Type>cfg:DocumentRef.Предписание</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеОбщедомовыхПриборовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛьготыСубсидииПодомовойУчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПоказанийПриборовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеСоставомЖильцов</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.ПредписаниеНаСнос</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерерасчетПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеДополнительныхНачислений</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеЛицевогоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.Иск</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЦветаЗаметок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЦветаЗаметок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Красный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Желтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Голубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Синий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиолетовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Заметки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Предмет") Тогда 
		Объект.Предмет = Параметры.Предмет;
		Объект.Пометка = УстановитьЦветовуюИндикацию(Параметры.Предмет);
	КонецЕсли;
	
	Элементы.Предмет.Заголовок = Объект.ПредставлениеПредмета;
	
	Элементы.Предмет.Гиперссылка = ЗначениеЗаполнено(Объект.Предмет);
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
		ФорматированныйТекст = Параметры.ЗначениеКопирования.Содержание.Получить();
		
		Элементы.ДатаЗаметки.Заголовок = НСтр("ru='Не записано';uk='Не записано'")
	Иначе
		Элементы.ДатаЗаметки.Заголовок = НСтр("ru='Записано';uk='Записано'") + ": " + Формат(Объект.ДатаИзменения, "ДЛФ=DDT");
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ФорматированныйТекст = ТекущийОбъект.Содержание.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Содержание = Новый ХранилищеЗначения(ФорматированныйТекст, Новый СжатиеДанных(9));
	
	ТекстHTML = "";
	Вложения = Новый Структура;
	ФорматированныйТекст.ПолучитьHTML(ТекстHTML, Вложения);
	
	ТекущийОбъект.ТекстСодержания = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML);
	
		  
 КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ДатаЗаметки.Заголовок = НСтр("ru='Записано';uk='Записано'") + ": " + Формат(Объект.ДатаИзменения, "ДЛФ=DDT");
	
	Источник = Объект.Ссылка;
	НеУстановленоНапоминание = ИнициализироватьДействияПередЗаписью(Источник);
	
	Если НеУстановленоНапоминание Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "ru = 'Установить напоминание?'; uk = 'Встановити нагадування?'";
			Ответ = Вопрос(НСтр(Текст),Режим,0);
			Если Ответ = КодВозвратаДиалога.Да тогда
				ПараметрыФормы = Новый Структура("Источник", Источник);
				ОткрытьФормуМодально("РегистрСведений.НапоминанияПользователя.Форма.Напоминание", ПараметрыФормы);
			КонецЕсли;
    КонецЕсли;
	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПредметНажатие(Элемент)
	ОткрытьЗначение(Объект.Предмет);
КонецПроцедуры

&НаКлиенте
Процедура АвторНажатие(Элемент)
	ОткрытьЗначение(Объект.Автор);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьВидимость()
	Элементы.Автор.Заголовок = Объект.Автор;
	ОткрытаАвтором = Объект.Автор = Пользователи.ТекущийПользователь();
	Элементы.ПараметрыОтображения.Видимость = ОткрытаАвтором;
	Элементы.ИнформацияОбАвторе.Видимость = Не ОткрытаАвтором;
	
	ТолькоПросмотр = Не ОткрытаАвтором;
	Элементы.Содержание.ТолькоПросмотр = Не ОткрытаАвтором;
	Элементы.КоманднаяПанельРедактирования.Видимость = ОткрытаАвтором;
КонецПроцедуры

&НаСервере
Функция ИнициализироватьДействияПередЗаписью(ЭтотОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НапоминанияПользователя.Пользователь,
	               |	НапоминанияПользователя.ВремяСобытия,
	               |	НапоминанияПользователя.Источник,
	               |	НапоминанияПользователя.СрокНапоминания,
	               |	НапоминанияПользователя.Описание,
	               |	НапоминанияПользователя.СпособУстановкиВремениНапоминания,
	               |	НапоминанияПользователя.ИнтервалВремениНапоминания,
	               |	НапоминанияПользователя.ИмяРеквизитаИсточника,
	               |	НапоминанияПользователя.Расписание,
	               |	НапоминанияПользователя.ПредставлениеИсточника
	               |ИЗ
	               |	РегистрСведений.НапоминанияПользователя КАК НапоминанияПользователя
	               |ГДЕ
	               |	НапоминанияПользователя.Источник = &Источник
	               |	И НапоминанияПользователя.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Источник", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Результат = Запрос.Выполнить();
	
	Возврат  Результат.Пустой(); 
			
КонецФункции // ИнициализироватьДействияПередЗаписью()


&НаСервере
Функция УстановитьЦветовуюИндикацию(СсылкаНаОбъект)

	МетаданныеЭлемента = СсылкаНаОбъект.Ссылка.Метаданные();
    
	ЛС = Метаданные.Подсистемы.ЛицевыеСчета;
	Приборы = Метаданные.Подсистемы.ПриборыУчета;
	Начисления = Метаданные.Подсистемы.Начисления;
	Запасы = Метаданные.Подсистемы.Запасы;
	Аварийная = Метаданные.Подсистемы.АварийноДиспечерскаяСлужба;
	Голосование = Метаданные.Подсистемы.Голосование;
	ПаспортныйСтол = Метаданные.Подсистемы.ПаспортныйСтол;
	
	Если ЛС.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Голубой;
		
	ИначеЕсли Приборы.Состав.Содержит(МетаданныеЭлемента) тогда
		
		Возврат Перечисления.ЦветаЗаметок.Оранжевый;
		
	ИначеЕсли Начисления.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Желтый;
		
	ИначеЕсли Запасы.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Зеленый;
		
	ИначеЕсли Аварийная.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Красный;
		
	ИначеЕсли ПаспортныйСтол.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Синий;
		
	ИначеЕсли Голосование.Состав.Содержит(МетаданныеЭлемента) тогда
		
		Возврат Перечисления.ЦветаЗаметок.Фиолетовый;	
		
	КонецЕсли;
		
				

КонецФункции // ()
